# Working With Data in Pandas

# importing that in pandas

In [5]:
import pandas as pd
car_data = pd.read_csv('car_dataframe.csv')

In [6]:
car_data

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,Toyota,$2000,2,114,10000,2000,20000000
1,Mitsuibush,$2300,4,230,2000,200,400000
2,Datsun,$4000,4,345,9320,3200,29824000
3,Lexus,$2000,7,120,45000,10450,470250000
4,Toyota,$18000,4,110,2104,230,483920

# selecting and viewing row in dataframe

In [8]:
car_make_price = car_data[['car_make', 'car-price']]

In [9]:
car_make_price

     car_make car-price
0      Toyota     $2000
1  Mitsuibush     $2300
2      Datsun     $4000
3       Lexus     $2000
4      Toyota    $18000

In [12]:
car_data['car_make'] = car_data['car_make'].str.lower()

In [13]:
car_data

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,toyota,$2000,2,114,10000,2000,20000000
1,mitsuibush,$2300,4,230,2000,200,400000
2,datsun,$4000,4,345,9320,3200,29824000
3,lexus,$2000,7,120,45000,10450,470250000
4,toyota,$18000,4,110,2104,230,483920

In [34]:
# selecting where car seat is 4.
car_seat_is_4_or_toyota = car_data[(car_data['seat_number'] == 4) | (car_data['car_make'] == 'toyota')]

In [36]:
car_seat_is_4_or_toyota

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,toyota,$2000,2,114,10000,2000,20000000
1,mitsuibush,$2300,4,230,2000,200,400000
2,datsun,$4000,4,345,9320,3200,29824000
4,toyota,$18000,4,110,2104,230,483920

In [37]:
car_seat_4_and_toyota = car_data[(car_data['seat_number'] == 4) & (car_data['car_make'] == 'toyota')]

In [38]:
car_seat_4_and_toyota

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
4,toyota,$18000,4,110,2104,230,483920